MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/hsmci.h
/* -------- HSMCI_IDR : (HSMCI Offset: 0x48) ( /W 32) Interrupt Disable Register -------- */
#define HSMCI_IDR_CMDRDY_Pos                  _UINT32_(0)                                          /* (HSMCI_IDR) Command Ready Interrupt Disable Position */
#define HSMCI_IDR_CMDRDY_Msk                  (_UINT32_(0x1) << HSMCI_IDR_CMDRDY_Pos)              /* (HSMCI_IDR) Command Ready Interrupt Disable Mask */
#define HSMCI_IDR_CMDRDY(value)               (HSMCI_IDR_CMDRDY_Msk & (_UINT32_(value) << HSMCI_IDR_CMDRDY_Pos)) /* Assignment of value for CMDRDY in the HSMCI_IDR register */
#define HSMCI_IDR_RXRDY_Pos                   _UINT32_(1)                                          /* (HSMCI_IDR) Receiver Ready Interrupt Disable Position */
#define HSMCI_IDR_RXRDY_Msk                   (_UINT32_(0x1) << HSMCI_IDR_RXRDY_Pos)               /* (HSMCI_IDR) Receiver Ready Interrupt Disable Mask */
#define HSMCI_IDR_RXRDY(value)                (HSMCI_IDR_RXRDY_Msk & (_UINT32_(value) << HSMCI_IDR_RXRDY_Pos)) /* Assignment of value for RXRDY in the HSMCI_IDR register */
#define HSMCI_IDR_TXRDY_Pos                   _UINT32_(2)                                          /* (HSMCI_IDR) Transmit Ready Interrupt Disable Position */
#define HSMCI_IDR_TXRDY_Msk                   (_UINT32_(0x1) << HSMCI_IDR_TXRDY_Pos)               /* (HSMCI_IDR) Transmit Ready Interrupt Disable Mask */
#define HSMCI_IDR_TXRDY(value)                (HSMCI_IDR_TXRDY_Msk & (_UINT32_(value) << HSMCI_IDR_TXRDY_Pos)) /* Assignment of value for TXRDY in the HSMCI_IDR register */
#define HSMCI_IDR_BLKE_Pos                    _UINT32_(3)                                          /* (HSMCI_IDR) Data Block Ended Interrupt Disable Position */
#define HSMCI_IDR_BLKE_Msk                    (_UINT32_(0x1) << HSMCI_IDR_BLKE_Pos)                /* (HSMCI_IDR) Data Block Ended Interrupt Disable Mask */
#define HSMCI_IDR_BLKE(value)                 (HSMCI_IDR_BLKE_Msk & (_UINT32_(value) << HSMCI_IDR_BLKE_Pos)) /* Assignment of value for BLKE in the HSMCI_IDR register */
#define HSMCI_IDR_DTIP_Pos                    _UINT32_(4)                                          /* (HSMCI_IDR) Data Transfer in Progress Interrupt Disable Position */
#define HSMCI_IDR_DTIP_Msk                    (_UINT32_(0x1) << HSMCI_IDR_DTIP_Pos)                /* (HSMCI_IDR) Data Transfer in Progress Interrupt Disable Mask */
#define HSMCI_IDR_DTIP(value)                 (HSMCI_IDR_DTIP_Msk & (_UINT32_(value) << HSMCI_IDR_DTIP_Pos)) /* Assignment of value for DTIP in the HSMCI_IDR register */
#define HSMCI_IDR_NOTBUSY_Pos                 _UINT32_(5)                                          /* (HSMCI_IDR) Data Not Busy Interrupt Disable Position */
#define HSMCI_IDR_NOTBUSY_Msk                 (_UINT32_(0x1) << HSMCI_IDR_NOTBUSY_Pos)             /* (HSMCI_IDR) Data Not Busy Interrupt Disable Mask */
#define HSMCI_IDR_NOTBUSY(value)              (HSMCI_IDR_NOTBUSY_Msk & (_UINT32_(value) << HSMCI_IDR_NOTBUSY_Pos)) /* Assignment of value for NOTBUSY in the HSMCI_IDR register */
#define HSMCI_IDR_SDIOIRQA_Pos                _UINT32_(8)                                          /* (HSMCI_IDR) SDIO Interrupt for Slot A Interrupt Disable Position */
#define HSMCI_IDR_SDIOIRQA_Msk                (_UINT32_(0x1) << HSMCI_IDR_SDIOIRQA_Pos)            /* (HSMCI_IDR) SDIO Interrupt for Slot A Interrupt Disable Mask */
#define HSMCI_IDR_SDIOIRQA(value)             (HSMCI_IDR_SDIOIRQA_Msk & (_UINT32_(value) << HSMCI_IDR_SDIOIRQA_Pos)) /* Assignment of value for SDIOIRQA in the HSMCI_IDR register */
#define HSMCI_IDR_SDIOWAIT_Pos                _UINT32_(12)                                         /* (HSMCI_IDR) SDIO Read Wait Operation Status Interrupt Disable Position */
#define HSMCI_IDR_SDIOWAIT_Msk                (_UINT32_(0x1) << HSMCI_IDR_SDIOWAIT_Pos)            /* (HSMCI_IDR) SDIO Read Wait Operation Status Interrupt Disable Mask */
#define HSMCI_IDR_SDIOWAIT(value)             (HSMCI_IDR_SDIOWAIT_Msk & (_UINT32_(value) << HSMCI_IDR_SDIOWAIT_Pos)) /* Assignment of value for SDIOWAIT in the HSMCI_IDR register */
#define HSMCI_IDR_CSRCV_Pos                   _UINT32_(13)                                         /* (HSMCI_IDR) Completion Signal received interrupt Disable Position */
#define HSMCI_IDR_CSRCV_Msk                   (_UINT32_(0x1) << HSMCI_IDR_CSRCV_Pos)               /* (HSMCI_IDR) Completion Signal received interrupt Disable Mask */
#define HSMCI_IDR_CSRCV(value)                (HSMCI_IDR_CSRCV_Msk & (_UINT32_(value) << HSMCI_IDR_CSRCV_Pos)) /* Assignment of value for CSRCV in the HSMCI_IDR register */
#define HSMCI_IDR_RINDE_Pos                   _UINT32_(16)                                         /* (HSMCI_IDR) Response Index Error Interrupt Disable Position */
#define HSMCI_IDR_RINDE_Msk                   (_UINT32_(0x1) << HSMCI_IDR_RINDE_Pos)               /* (HSMCI_IDR) Response Index Error Interrupt Disable Mask */
#define HSMCI_IDR_RINDE(value)                (HSMCI_IDR_RINDE_Msk & (_UINT32_(value) << HSMCI_IDR_RINDE_Pos)) /* Assignment of value for RINDE in the HSMCI_IDR register */
#define HSMCI_IDR_RDIRE_Pos                   _UINT32_(17)                                         /* (HSMCI_IDR) Response Direction Error Interrupt Disable Position */
#define HSMCI_IDR_RDIRE_Msk                   (_UINT32_(0x1) << HSMCI_IDR_RDIRE_Pos)               /* (HSMCI_IDR) Response Direction Error Interrupt Disable Mask */
#define HSMCI_IDR_RDIRE(value)                (HSMCI_IDR_RDIRE_Msk & (_UINT32_(value) << HSMCI_IDR_RDIRE_Pos)) /* Assignment of value for RDIRE in the HSMCI_IDR register */
#define HSMCI_IDR_RCRCE_Pos                   _UINT32_(18)                                         /* (HSMCI_IDR) Response CRC Error Interrupt Disable Position */
#define HSMCI_IDR_RCRCE_Msk                   (_UINT32_(0x1) << HSMCI_IDR_RCRCE_Pos)               /* (HSMCI_IDR) Response CRC Error Interrupt Disable Mask */
#define HSMCI_IDR_RCRCE(value)                (HSMCI_IDR_RCRCE_Msk & (_UINT32_(value) << HSMCI_IDR_RCRCE_Pos)) /* Assignment of value for RCRCE in the HSMCI_IDR register */
#define HSMCI_IDR_RENDE_Pos                   _UINT32_(19)                                         /* (HSMCI_IDR) Response End Bit Error Interrupt Disable Position */
#define HSMCI_IDR_RENDE_Msk                   (_UINT32_(0x1) << HSMCI_IDR_RENDE_Pos)               /* (HSMCI_IDR) Response End Bit Error Interrupt Disable Mask */
#define HSMCI_IDR_RENDE(value)                (HSMCI_IDR_RENDE_Msk & (_UINT32_(value) << HSMCI_IDR_RENDE_Pos)) /* Assignment of value for RENDE in the HSMCI_IDR register */
#define HSMCI_IDR_RTOE_Pos                    _UINT32_(20)                                         /* (HSMCI_IDR) Response Time-out Error Interrupt Disable Position */
#define HSMCI_IDR_RTOE_Msk                    (_UINT32_(0x1) << HSMCI_IDR_RTOE_Pos)                /* (HSMCI_IDR) Response Time-out Error Interrupt Disable Mask */
#define HSMCI_IDR_RTOE(value)                 (HSMCI_IDR_RTOE_Msk & (_UINT32_(value) << HSMCI_IDR_RTOE_Pos)) /* Assignment of value for RTOE in the HSMCI_IDR register */
#define HSMCI_IDR_DCRCE_Pos                   _UINT32_(21)                                         /* (HSMCI_IDR) Data CRC Error Interrupt Disable Position */
#define HSMCI_IDR_DCRCE_Msk                   (_UINT32_(0x1) << HSMCI_IDR_DCRCE_Pos)               /* (HSMCI_IDR) Data CRC Error Interrupt Disable Mask */
#define HSMCI_IDR_DCRCE(value)                (HSMCI_IDR_DCRCE_Msk & (_UINT32_(value) << HSMCI_IDR_DCRCE_Pos)) /* Assignment of value for DCRCE in the HSMCI_IDR register */
#define HSMCI_IDR_DTOE_Pos                    _UINT32_(22)                                         /* (HSMCI_IDR) Data Time-out Error Interrupt Disable Position */
#define HSMCI_IDR_DTOE_Msk                    (_UINT32_(0x1) << HSMCI_IDR_DTOE_Pos)                /* (HSMCI_IDR) Data Time-out Error Interrupt Disable Mask */
#define HSMCI_IDR_DTOE(value)                 (HSMCI_IDR_DTOE_Msk & (_UINT32_(value) << HSMCI_IDR_DTOE_Pos)) /* Assignment of value for DTOE in the HSMCI_IDR register */
#define HSMCI_IDR_CSTOE_Pos                   _UINT32_(23)                                         /* (HSMCI_IDR) Completion Signal Time out Error Interrupt Disable Position */
#define HSMCI_IDR_CSTOE_Msk                   (_UINT32_(0x1) << HSMCI_IDR_CSTOE_Pos)               /* (HSMCI_IDR) Completion Signal Time out Error Interrupt Disable Mask */
#define HSMCI_IDR_CSTOE(value)                (HSMCI_IDR_CSTOE_Msk & (_UINT32_(value) << HSMCI_IDR_CSTOE_Pos)) /* Assignment of value for CSTOE in the HSMCI_IDR register */
#define HSMCI_IDR_BLKOVRE_Pos                 _UINT32_(24)                                         /* (HSMCI_IDR) DMA Block Overrun Error Interrupt Disable Position */
#define HSMCI_IDR_BLKOVRE_Msk                 (_UINT32_(0x1) << HSMCI_IDR_BLKOVRE_Pos)             /* (HSMCI_IDR) DMA Block Overrun Error Interrupt Disable Mask */
#define HSMCI_IDR_BLKOVRE(value)              (HSMCI_IDR_BLKOVRE_Msk & (_UINT32_(value) << HSMCI_IDR_BLKOVRE_Pos)) /* Assignment of value for BLKOVRE in the HSMCI_IDR register */
#define HSMCI_IDR_FIFOEMPTY_Pos               _UINT32_(26)                                         /* (HSMCI_IDR) FIFO empty Interrupt Disable Position */
#define HSMCI_IDR_FIFOEMPTY_Msk               (_UINT32_(0x1) << HSMCI_IDR_FIFOEMPTY_Pos)           /* (HSMCI_IDR) FIFO empty Interrupt Disable Mask */
#define HSMCI_IDR_FIFOEMPTY(value)            (HSMCI_IDR_FIFOEMPTY_Msk & (_UINT32_(value) << HSMCI_IDR_FIFOEMPTY_Pos)) /* Assignment of value for FIFOEMPTY in the HSMCI_IDR register */
#define HSMCI_IDR_XFRDONE_Pos                 _UINT32_(27)                                         /* (HSMCI_IDR) Transfer Done Interrupt Disable Position */
#define HSMCI_IDR_XFRDONE_Msk                 (_UINT32_(0x1) << HSMCI_IDR_XFRDONE_Pos)             /* (HSMCI_IDR) Transfer Done Interrupt Disable Mask */
#define HSMCI_IDR_XFRDONE(value)              (HSMCI_IDR_XFRDONE_Msk & (_UINT32_(value) << HSMCI_IDR_XFRDONE_Pos)) /* Assignment of value for XFRDONE in the HSMCI_IDR register */
#define HSMCI_IDR_ACKRCV_Pos                  _UINT32_(28)                                         /* (HSMCI_IDR) Boot Acknowledge Interrupt Disable Position */
#define HSMCI_IDR_ACKRCV_Msk                  (_UINT32_(0x1) << HSMCI_IDR_ACKRCV_Pos)              /* (HSMCI_IDR) Boot Acknowledge Interrupt Disable Mask */
#define HSMCI_IDR_ACKRCV(value)               (HSMCI_IDR_ACKRCV_Msk & (_UINT32_(value) << HSMCI_IDR_ACKRCV_Pos)) /* Assignment of value for ACKRCV in the HSMCI_IDR register */
#define HSMCI_IDR_ACKRCVE_Pos                 _UINT32_(29)                                         /* (HSMCI_IDR) Boot Acknowledge Error Interrupt Disable Position */
#define HSMCI_IDR_ACKRCVE_Msk                 (_UINT32_(0x1) << HSMCI_IDR_ACKRCVE_Pos)             /* (HSMCI_IDR) Boot Acknowledge Error Interrupt Disable Mask */
#define HSMCI_IDR_ACKRCVE(value)              (HSMCI_IDR_ACKRCVE_Msk & (_UINT32_(value) << HSMCI_IDR_ACKRCVE_Pos)) /* Assignment of value for ACKRCVE in the HSMCI_IDR register */
#define HSMCI_IDR_OVRE_Pos                    _UINT32_(30)                                         /* (HSMCI_IDR) Overrun Interrupt Disable Position */
#define HSMCI_IDR_OVRE_Msk                    (_UINT32_(0x1) << HSMCI_IDR_OVRE_Pos)                /* (HSMCI_IDR) Overrun Interrupt Disable Mask */
#define HSMCI_IDR_OVRE(value)                 (HSMCI_IDR_OVRE_Msk & (_UINT32_(value) << HSMCI_IDR_OVRE_Pos)) /* Assignment of value for OVRE in the HSMCI_IDR register */
#define HSMCI_IDR_UNRE_Pos                    _UINT32_(31)                                         /* (HSMCI_IDR) Underrun Interrupt Disable Position */
#define HSMCI_IDR_UNRE_Msk                    (_UINT32_(0x1) << HSMCI_IDR_UNRE_Pos)                /* (HSMCI_IDR) Underrun Interrupt Disable Mask */
#define HSMCI_IDR_UNRE(value)                 (HSMCI_IDR_UNRE_Msk & (_UINT32_(value) << HSMCI_IDR_UNRE_Pos)) /* Assignment of value for UNRE in the HSMCI_IDR register */
#define HSMCI_IDR_Msk                         _UINT32_(0xFDFF313F)                                 /* (HSMCI_IDR) Register Mask  */


